[
    {
        "content": "Tidak akan bergeser kaki seorang hamba pada hari kiamat sampai ia ditanya tentang umurnya untuk apa ia habiskan, ilmunya untuk apa ia amalkan, hartanya dari mana ia peroleh dan kemana ia belanjakan.",
        "source": "HR. Tirmidzi",
        "type": "hadith"
    },
    {
        "content": "Allah akan memberikan rahmat kepada seseorang yang berusaha mencari harta dengan jalan yang halal, dan menyedekahkan harta tersebut dengan jalan yang benar.",
        "source": "HR. Bukhari",
        "type": "hadith"
    },
    {
        "content": "Sesungguhnya pemboros-pemboros itu adalah saudara-saudara syaitan.",
        "source": "QS. Al-Isra: 27",
        "type": "quran"
    },
    {
        "content": "Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu (pelit), dan janganlah kamu terlalu mengulurkannya (boros).",
        "source": "QS. Al-Isra: 29",
        "type": "quran"
    },
    {
        "content": "Harta tidak akan berkurang karena sedekah.",
        "source": "HR. Muslim",
        "type": "hadith"
    },
    {
        "content": "Kekayaan bukanlah dengan banyaknya harta, namun kekayaan adalah kekayaan hati (qanaah).",
        "source": "HR. Bukhari & Muslim",
        "type": "hadith"
    },
    {
        "content": "Sebaik-baik harta adalah harta yang berada dalam penguasaan orang saleh.",
        "source": "HR. Ahmad",
        "type": "hadith"
    },
    {
        "content": "Menunda-nunda pembayaran hutang bagi orang yang mampu adalah kezaliman.",
        "source": "HR. Bukhari",
        "type": "hadith"
    },
    {
        "content": "Jiwa seorang mukmin itu terkatung-katung karena hutangnya, sampai hutang itu ‘dilunasi’.",
        "source": "HR. Tirmidzi",
        "type": "hadith"
    },
    {
        "content": "Barangsiapa yang mengambil harta manusia dengan niat ingin melunasinya, Allah akan melunasinya.",
        "source": "HR. Bukhari",
        "type": "hadith"
    },
    {
        "content": "Tangan di atas lebih baik daripada tangan di bawah.",
        "source": "HR. Bukhari",
        "type": "hadith"
    },
    {
        "content": "Makanlah, minumlah, berpakaianlah, dan bersedekahlah tanpa berlebihan dan tanpa sombong.",
        "source": "HR. Abu Daud",
        "type": "hadith"
    },
    {
        "content": "Sedekah itu dapat menghapus dosa sebagaimana air itu memadamkan api.",
        "source": "HR. Tirmidzi",
        "type": "hadith"
    },
    {
        "content": "Jauhilah tujuh dosa yang membinasakan... (salah satunya) memakan riba.",
        "source": "HR. Bukhari & Muslim",
        "type": "hadith"
    },
    {
        "content": "Allah memusnahkan riba dan menyuburkan sedekah.",
        "source": "QS. Al-Baqarah: 276",
        "type": "quran"
    },
    {
        "content": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan tinggalkan sisa riba jika kamu orang-orang yang beriman.",
        "source": "QS. Al-Baqarah: 278",
        "type": "quran"
    },
    {
        "content": "Sesungguhnya Allah menyukai apabila salah seorang dari kamu melakukan suatu pekerjaan, ia melakukannya dengan itqan (tekun/rapi).",
        "source": "HR. Baihaqi",
        "type": "hadith"
    },
    {
        "content": "Bekerjalah untuk duniamu seakan-akan engkau hidup selamanya, dan bekerjalah untuk akhiratmu seakan-akan engkau mati besok.",
        "source": "Kutipan Ulama",
        "type": "quote"
    },
    {
        "content": "Hemat pangkal kaya, rajin pangkal pandai.",
        "source": "Peribahasa",
        "type": "quote"
    },
    {
        "content": "Jangan membeli apa yang tidak kamu butuhkan, meski itu murah.",
        "source": "Jefferson",
        "type": "quote"
    },
    {
        "content": "Jika kamu membeli barang yang tidak kamu butuhkan, kamu akan segera menjual barang yang kamu butuhkan.",
        "source": "Warren Buffett",
        "type": "quote"
    },
    {
        "content": "Jangan menyimpan apa yang tersisa setelah belanja, tapi belanjakan apa yang tersisa setelah menabung.",
        "source": "Warren Buffett",
        "type": "quote"
    },
    {
        "content": "Investasi terbaik yang bisa kamu lakukan adalah investasi pada dirimu sendiri.",
        "source": "Warren Buffett",
        "type": "quote"
    },
    {
        "content": "Bukan seberapa banyak uang yang kamu hasilkan, tapi seberapa banyak uang yang bisa kamu simpan.",
        "source": "Robert Kiyosaki",
        "type": "quote"
    },
    {
        "content": "Aset adalah sesuatu yang memasukkan uang ke dalam saku Anda. Liabilitas adalah sesuatu yang mengeluarkan uang dari saku Anda.",
        "source": "Robert Kiyosaki",
        "type": "quote"
    },
    {
        "content": "Orang kaya fokus pada aset, sementara orang miskin dan kelas menengah fokus pada liabilitas (yang mereka kira aset).",
        "source": "Robert Kiyosaki",
        "type": "quote"
    },
    {
        "content": "Takut akan kegagalan adalah penghalang terbesar menuju kesuksesan finansial.",
        "source": "Robert Kiyosaki",
        "type": "quote"
    },
    {
        "content": "Orang yang tidak bisa mengendalikan emosinya tidak bisa mengendalikan uangnya.",
        "source": "Warren Buffett",
        "type": "quote"
    },
    {
        "content": "Waktu adalah uang.",
        "source": "Benjamin Franklin",
        "type": "quote"
    },
    {
        "content": "Sebuah sen yang dihemat adalah sebuah sen yang dhasilkan.",
        "source": "Benjamin Franklin",
        "type": "quote"
    },
    {
        "content": "Berhati-hatilah dengan pengeluaran kecil; kebocoran kecil bisa menenggelamkan kapal besar.",
        "source": "Benjamin Franklin",
        "type": "quote"
    },
    {
        "content": "Kebahagiaan bukan tentang memiliki banyak uang, tapi tentang kebebasan yang diberikan uang.",
        "source": "Unknown",
        "type": "quote"
    },
    {
        "content": "Uang adalah hamba yang baik, tapi tuan yang buruk.",
        "source": "P.T. Barnum",
        "type": "quote"
    },
    {
        "content": "Belilah pengalaman, bukan barang.",
        "source": "Saran Milenial",
        "type": "quote"
    },
    {
        "content": "Miliki anggaran. Uang tanpa anggaran seperti air di tangan yang terbuka.",
        "source": "Unknown",
        "type": "quote"
    },
    {
        "content": "Gaji hanyalah suap yang diberikan mereka agar Anda melupakan mimpi-mimpi Anda.",
        "source": "Unknown",
        "type": "quote"
    },
    {
        "content": "Kekayaan yang paling berharga adalah waktu. Gunakanlah dengan bijak.",
        "source": "Unknown",
        "type": "quote"
    },
    {
        "content": "Orang bijak menyiapkan lumbung di musim panen untuk musim paceklik.",
        "source": "Nasihat Bijak",
        "type": "quote"
    },
    {
        "content": "Berhutang itu mudah, membayarnya yang susah. Pikir dua kali sebelum berhutang.",
        "source": "Nasihat Keuangan",
        "type": "quote"
    },
    {
        "content": "Sedekah di kala sempit lebih dahsyat balasannya.",
        "source": "Hikmah Islam",
        "type": "quote"
    }
]